LEXICON_COMMANDS_RU = {
    '/start': 'Начать работу с ботом',
    '/help': 'Справка по работе бота',
    '/bookmarks': 'Мои закладки',
    '/my_papers': 'Ранее найденные работы'
}

LEXICON_COMMANDS_DESCRIPTION = {
    '/start': '<b>Привет, пользователь!</b>\n\nЭто бот, в котором '
              'ты можешь найти различные статьи западных источников'
              '\n\nЧтобы посмотреть список доступных '
              'команд - набери /help',
    '/help': 'Цель этого бота - реализовать интерфейс для поиска общедоступных статей'
             'западных источников.\n\n'
             'Перед начало поиска статей заполните соотвествующие поля данные для агрегации.\n'
             'Для проверки введеных параметров выберите соотвествующий пункт на клавиатуре.\n'
             'Доступые комманды: \n\n/start - '
             'Начать работу с ботом\n/help - Получить справку по работе с ботом\n'
             '/bookmarks - Список ваших избранных работ\n'
             '/my_papers - Список ранее обнаруженых вами научных статей'
}

LEXICON_RUS = {
    'start': 'Начнем работу!',
    'help': 'Справка по работе с ботом',
    'error': 'Обнаружена некорректная команда\n\n'
             'Для начала работы бота нажмите /start\n\n',
    'cancel': 'Отмена',
    'cancel_message': 'Действие отменено.',
    'read': 'Читать найденные работы',
    'read_own_papers': 'Читать ранее сохраненные работы',
    'entered_parameters': 'Проверить введеные данные',
    'finished': 'Закончить ввод данных',
    'back': 'Вернуться к предыдущему меню',
    'terms': 'Название/темы статьи',
    'source_published': 'Журнал/издание, где опубликована статья',
    'authors': 'Автор(ы)',
    'years': 'Год выпуска',
    'pages': 'Количество страниц',
    'fill_parameters': 'Ввести данные для поиска',
    'save_parameters': 'Введеные данные для поиска сохранены!\n\n',
    'empty_parameters': 'Вы не ввели никаких данных для поиска.\n'
                        'Будут использованы последние валидные введеные данные.',
    'no_one_saved_parameters': 'Не найдено сохраненных данных для поиска статей.\n\n'
                               'Пожалуйства введите данные для поиска, выбрав соотвествующее поле в меню.',
    'run_aggregation_papers': 'Начать поиск научных статей',
    'add_to_bookmarks': 'Добавить статью в закладки',
    'bookmarks': 'Ваши избранные работы.\n\n',
    'no_bookmarks': 'Не найдено ни одной сохраненной статьи',
    'edit_bookmarks_button': '❌ РЕДАКТИРОВАТЬ',
    'cancel_editing_bookmarks': 'Закладки убраны.',
    'del': '❌',
    'backward': '<<',
    'forward': '>>',
}
