LEXICON_COMMANDS_RU = {
    '/start': 'Привет!\nЭтот бот умеет агрегировать информацию из различных источников!',
    '/help': 'Привет!\nСкоро тут будет будет инфа по помощи!'
}
LEXICON_RUS = {
    'start': 'Начнем работу!',
    'help': 'Помощь',
    'cancel': 'Отмена',
    'read': 'Читать найденные работы',
    'favorite': 'Избранные работы',
    'entered_parameters': 'Проверить введеные данные',
    'finished': 'Закончить ввод данных',
    'back': 'Вернуться к предыдущему меню',
    'terms': 'Название/темы статьи',
    'source_published': 'Журнал/издание, где опубликована статья',
    'authors': 'Автор(ы)',
    'years': 'Год выпуска',
    'pages': 'Количество страниц',
    'start_fill_based_parameters': 'Ввести данные для поиска',
    'run_aggregation_papers': 'Найти',
    'backward': '<<',
    'forward': '>>',
    'add_to_bookmarks': 'Добавить статью в закладки',
    'no_bookmarks': 'Не найдено ни одной сохраненной статьи',
    'edit_bookmarks_button': '❌ РЕДАКТИРОВАТЬ',
    'del': '❌',
    'cancel_editing_bookmarks': 'Закладки убраны.'
}
